# Напишите программу, которая по заданному номеру четверти, 
# показывает диапазон возможных координат точек в этой четверти (x и y).
print ('enter number 1-4')
x = int(input())
if 0<x<5:
    if x==1: print ('x:(0,+~), y:(0,+~)') 
    elif x==2: print ('x:(0,+~), y:(0,-~)') 
    elif x==3: print ('x:(0,-~), y:(0,-~)') 
    elif x==4: print ('x:(0,-~), y:(0,+~)') 
else: print ('not number 1-4')