# Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]
a = [int(i) for i in input('enter numbers ').split()]
c=int(len(a)/2)
for i in range (c):
    print(a[i]*a[len(a)-1-i])
    i+=1
if len(a)%2!=0: print (a[c]**2)   
