# Напишите программу для. проверки истинности утверждения
#  ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.

print ('enter x, y, z ')
x = bool(input())
y = bool(input())
z = bool(input())

if not 
