/* Напишите программу, которая принимает на вход пятизначное
 число и проверяет, является ли оно палиндромом*/
Console.WriteLine("Ведите пятизначноечисло");
string n = Console.ReadLine();
//int [] array = new int[5];
//int i = 0;
/*for (i=0; i<n.Length; i++)
{
    n [i] = array [i]; 
}*/


void Pallindrom (string)
{if (true)
{   int last = n.Length-1;
    for (int i=0; i<last/2; i++)
    n[i] == n [last];
Console.WriteLine("Да");
}
}
void Pallindrom (string n);

